---
kind: type
id: T:Autodesk.Revit.DB.NavisworksExportScope
source: html/5133006b-034f-1f05-5b8b-37aa7f12c4e0.htm
---
# Autodesk.Revit.DB.NavisworksExportScope

An enumerated type listing possible "Element Scopes" of Navisworks Exporter.

## Syntax (C#)
```csharp
public enum NavisworksExportScope
```